app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "ID is 2"], ["description", "Second post"], ["updated_at", "2018-05-18 16:57:31.903572"], ["id", 2]]
---
	def update
		@post = Post.find(params[:id])
		@post.update(title: params[:title], description: = params[:description])